app/controllers/authentications_controller.rb

INSERT INTO "users" ("username", "first_name", "last_name", "created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def register
    user = User.new(user_params)
    if user.save