app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "word_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "yo"], ["word_id", 25], ["created_at", 2016-10-27 12:19:40 UTC], ["updated_at", 2016-10-27 12:19:40 UTC]]
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save