app/controllers/words_controller.rb

  def index
    @words = Word.all
---
SELECT "words".* FROM "words"

  def create
    @word = Word.new(word_params)

    if @word.save
---
INSERT INTO "words" ("user_id", "headword", "part_of_speech", "external_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["headword", "height"], ["part_of_speech", "noun"], ["external_id", "cs1sc8awBm"], ["created_at", 2016-10-26 19:43:08 UTC], ["updated_at", 2016-10-26 19:43:08 UTC]]

  def destroy
    @word.destroy
---
DELETE FROM "words" WHERE "words"."id" = $1  [["id", 5]]

    def set_word
      @word = Word.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]